# *nix stuff
brew "bash"
brew "bash-completion"
brew "curl-openssl"
brew "coreutils"
brew "git"
brew "openssl@1.1"
brew "ssh-copy-id"
brew "telnet"
brew "vim"
tap "raggi/ale"
brew "openssl-osx-ca", restart_service: true

# misc utils
brew "ansible"
brew "ipcalc"
brew "jq"
brew "the_silver_searcher"

# dev
brew "python"
brew "pyenv-virtualenvwrapper"
tap "jawshooah/pyenv"
brew 'jawshooah/pyenv/pyenv-default-packages', args: ['HEAD']
cask "docker"
cask "vagrant"
cask "virtualbox"

# apps
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "rambox"
cask "spotify"
cask "visual-studio-code"
mas "Evernote", id: 406056744
mas "Owly", id: 882812218
mas "Todoist", id: 585829637

# misc apps
cask "clipy"
cask "rectangle"  # spectacle successor?
cask "muzzle"
