# *nix stuff
brew "bash"
brew "bash-completion"
brew "curl-openssl"
brew "coreutils"
brew "git"
brew "openssl@1.1"
brew "ssh-copy-id"
brew "telnet"
brew "vim"

# misc utils
brew "ansible"
brew "ipcalc"
brew "the_silver_searcher"

# dev
tap "jvale/python2"
brew "python@2"
brew "python@3.8"
cask "docker"
cask "miniconda"
cask "virtualbox"

# apps
cask "firefox"
cask "iterm2"
cask "rambox"
cask "spotify"
cask "visual-studio-code"
mas "Evernote", id: 406056744
mas "Owly", id: 882812218
mas "Todoist", id: 585829637

# misc apps
cask "clipy"
cask "rectangle"  # spectacle successor?
cask "muzzle"
